# 1) несмотря на возможность - не стоит давать своим объектам имена match и case
# 2) _ - универсальный символ (wildcard), может быть добавлен в конце для отработки всех
# остальных вариантов
# 3) [a,b], (a,b) и a,b равнозначны, ожидается последовательность (кроме строки и байтов),
# но не set или dict
# 4) допустим вызов только типов (float(), str(), MyClass() и т.д.), обращения по индексу
# недопустимы
# 5) после паттерна может быть добавлен guard начинающийся с if, он сработает только при удачном
# сравнении шаблона
# 6) последовательности (sequence) проверяются строго по содержимому и размеру, маппинги (dict)
# проверяют только конкретные вхождения ключей
# 7) имена привязываются (bind) локально, они доступны вне контекста match, для использования в
# нешних констант нужно использовать точку
# 8) применяются правила распаковки
# 9) для OR случаев должны быть привязаны одинаковые имена
# 10)  AS позволит привязать имя даже внутри паттерна
# 11)  проверять типы можно даже внутри паттерна и при привязке имени
#
# НЕЛЬЗЯ:
# 1) писать **_ для маппингов (dict)
# 2) вызывать свои функции или обращаться к какой то коллекции по индексу (a_list[x]) в блоке case
# 3) привязывать разные имена при использовании OR (|)
